foam_cases/cube_test/0/U
FoamFile
{
    format ascii;
    class volVectorField;
    location "0";
    object U;
}

dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0 0);

boundaryField
{
defaultWall
{
        type noSlip;
}
}
